In [6]:
import pandas as pd

In [7]:
df = pd.read_json("../data/list_data.json", orient="records")
df

                          date  quantity        item  price
0    2023-01-01 00:32:24+00:00         8      cherry    2.3
1    2023-01-01 01:11:10+00:00         8       mango    6.0
2    2023-01-01 01:15:09+00:00         7  watermelon    4.7
3    2023-01-01 01:37:20+00:00        10       apple    2.0
4    2023-01-01 02:46:13+00:00         4       apple    2.0
...                        ...       ...         ...    ...
9930 2023-12-30 20:59:40+00:00        10  strawberry    5.2
9931 2023-12-30 21:13:13+00:00         5  strawberry    5.2
9932 2023-12-30 21:58:51+00:00         6      banana    1.5
9933 2023-12-30 22:12:52+00:00         7      cherry    2.3
9934 2023-12-30 23:51:19+00:00        10       mango    6.0

[9935 rows x 4 columns]

In [10]:
def per_item_agg(df):
    return (
        df
        .assign(
            revenue=lambda df_: df_["quantity"] * df_["price"]
        )
        .groupby("item")
        .agg(
            total_revenue=("revenue", "sum"),
            total_sales=("date", "count"),
            total_quantity=("quantity", "sum"),
        )
        .assign(
            average_per_sale=total_quantity / total_sales
        )
        .drop(columns=["total_sales"])
    )

df.pipe(per_item_agg)

            total_revenue  total_sales  total_quantity
item
apple             11162.0         1007            5581
avocado           27658.8          979            5319
banana             7855.5          955            5237
cherry            12907.6         1025            5612
lemon             17846.4         1015            5577
mango             32724.0         1004            5454
papaya            39587.9          994            5423
pineapple         36153.2          958            5396
strawberry        28698.8         1012            5519
watermelon        26127.3          986            5559

In [ ]:
def per_item_month_agg(df):
    return (
        df
        .assign(
            revenue=lambda df_: df_["quantity"] * df_["price"]
            year=lambda df_: df_["date"].dt.year,
            month=lambda df_: df_["date"].dt.month,
        )
        .groupby(["item", "year", "month"])
        .agg(
            total_revenue=("revenue", "sum"),
            total_sales=("date", "count"),
            total_quantity=("quantity", "sum"),
        )
        .assign(
            average_per_sale=total_quantity / total_sales
        )
        .drop(columns=["total_sales"])
    )

df.pipe(per_item_agg)